{
  "_name_or_path": "bert-base-multilingual-cased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "certain conditions originating in the perinatal period",
    "1": "certain infectious and parasitic diseases",
    "2": "codes for special purposes",
    "3": "congenital malformations deformations and chromosomal abnormalities",
    "4": "diseases of the blood and blood-forming organs and certain disorders involving the immune mechanism",
    "5": "diseases of the circulatory system",
    "6": "diseases of the digestive system",
    "7": "diseases of the ear and mastoid process",
    "8": "diseases of the eye and adnexa",
    "9": "diseases of the genitourinary system",
    "10": "diseases of the musculoskeletal system and connective tissue",
    "11": "diseases of the nervous system",
    "12": "diseases of the respiratory system",
    "13": "diseases of the skin and subcutaneous tissue",
    "14": "endocrine nutritional and metabolic diseases",
    "15": "external causes of morbidity",
    "16": "factors influencing health status and contact with health services",
    "17": "injury poisoning and certain other consequences of external causes",
    "18": "mental behavioral and neurodevelopmental disorders",
    "19": "neoplasms",
    "20": "pregnancy childbirth and the puerperium",
    "21": "symptoms signs and abnormal clinical and laboratory findings not elsewhere classified",
    "22": "unknown"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "certain conditions originating in the perinatal period": 0,
    "certain infectious and parasitic diseases": 1,
    "codes for special purposes": 2,
    "congenital malformations deformations and chromosomal abnormalities": 3,
    "diseases of the blood and blood-forming organs and certain disorders involving the immune mechanism": 4,
    "diseases of the circulatory system": 5,
    "diseases of the digestive system": 6,
    "diseases of the ear and mastoid process": 7,
    "diseases of the eye and adnexa": 8,
    "diseases of the genitourinary system": 9,
    "diseases of the musculoskeletal system and connective tissue": 10,
    "diseases of the nervous system": 11,
    "diseases of the respiratory system": 12,
    "diseases of the skin and subcutaneous tissue": 13,
    "endocrine nutritional and metabolic diseases": 14,
    "external causes of morbidity": 15,
    "factors influencing health status and contact with health services": 16,
    "injury poisoning and certain other consequences of external causes": 17,
    "mental behavioral and neurodevelopmental disorders": 18,
    "neoplasms": 19,
    "pregnancy childbirth and the puerperium": 20,
    "symptoms signs and abnormal clinical and laboratory findings not elsewhere classified": 21,
    "unknown": 22
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.47.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
